# cairo_zones.py

zone_map_dict = {
    "A": [
        "الرحاب","جاردن سيتي","الزمالك","مصر الجديدة","النزهة","النزهة الجديدة",
        "شيراتون المطار","زهراء المعادي","القطامية","المقطم","المنيل"
    ],
    "B": [
        "مدينة نصر","حدائق القبة","حلمية الزيتون","العباسية","الظاهر","الوايلي",
        "روض الفرج","جسر السويس","الأميرية","عابدين","باب الشعرية",
        "وسط البلد","باب اللوق","القاهرة القبطية","الفسطاط",
        "المعادي","حلوان"
    ],
    "C": [
        "المرج","عزبة النخل","المطرية","عين شمس","الزاوية الحمراء","الشرابية",
        "الخليفة","الدرب الأحمر","السيدة زينب","الحسين","الجمالية",
        "خان الخليلي","حارة اليهود","بولاق","الموسكي","الحلمية",
        "المغربلين","الخرنفش","دار السلام","البساتين","مقابر اليهود",
        "زينهم","منشأة ناصر","كوتسيكا","طرة الشعبية","التبين","المعصرة"
    ]
}

def get_zone_class(area_name: str):
    """يحدد Class الحي بناءً على الاسم"""
    for zone_class, areas in zone_map_dict.items():
        for a in areas:
            if a in area_name:
                return zone_class
    return "B"  # لو مش لاقي نخليه متوسط B
